module.exports = {
    'Отображение': [
        'Корректное отображение'
    ],
    'Внешний вид и ссылки': [
        'Проверка внешнего вида и ссылок'
    ],
    'Внешний вид': [
        'Проверка внешнего вида'
    ],
    'Показ': [
        'Проверка отображения'
    ],
    'Отправка счётчика': [
        'Проверка счётчика'
    ],
    'Нажатие на кнопку': [
        'Проверка кнопки'
    ],
    'Взаимодействие': [
        'Проверка взаимодействия'
    ],
    'Взаимодействие': [
        'Проверка взаимодействия'
    ],
    'Соответствие': [
        'Проверка соответствия'
    ],
    'Переход': [
        'Проверка перехода'
    ],
    'Ссылка и счётчик': [
        'Проверка ссылки и счетчика',
        'Проверить ссылки и счётчики'
    ],
    'Раскрытие': [
        'Проверка раскрытия'
    ],
    'Дисклеймер': [
        'Проверка дисклеймера'
    ],
    'Базовое поведение': [
        'Обязательные проверки',
        'Базовая проверка'
    ]
};
