INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Другое', N'test', N'Staff', N'Новый сотрудник, менее 2 нед.', N'Кладовщик',
        null, N'2021-09-15 10:00:00.000', 9, 9, 0, 150.64, 9, N'2021-09-15 10:00', N'дневная смена', N'0.16',
        N'Не эффективная работа', N'2021-09-16');
INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Консолидация', N'test', N'Staff', N'Новый сотрудник, менее 2 нед.',
        N'Кладовщик', N'S06 (1 из 2)', N'2021-09-15 09:00:00.000', 25, 53, 0.11345483662105718, 71.3, 25,
        N'2021-09-15 09:00', N'дневная смена', N'0.16', N'Не эффективная работа', N'2021-09-15');
INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Консолидация', N'Иванов Иван Иванович', N'Staff', N'Новый сотрудник, менее 2 нед.',
        N'Кладовщик', N'S22 (1 из 4)', N'2021-09-15 11:00:00.000', 221, 9, 0.9823992090101853, 108.5, 221,
        N'2021-09-15 11:00', N'дневная смена', N'0.16', N'Не эффективная работа', N'2021-09-15');
INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Консолидация', N'Иванов Иван Иванович', N'Staff', N'Новый сотрудник, менее 2 нед.',
        N'Кладовщик', N'S09 (1 из 4)', N'2021-09-15 12:00:00.000', 222, 41, 0.9868168789094661, 477.40000000000003, 222,
        N'2021-09-15 12:00', N'дневная смена', N'0.16', N'Не эффективная работа', N'2021-09-15');
INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Отбор', N'Иванов Иван Иванович', N'Staff', N'Новый сотрудник, менее 2 нед.', N'Кладовщик',
        N'KGT-CONS02', N'2021-09-15 09:00:00.000', 9, 6, 0, 0, 9, N'2021-09-15 09:00', N'дневная смена', N'0.16',
        N'Не эффективная работа', N'2021-09-15');
INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Отбор', N'Иванов Иван Иванович', N'Staff', N'Новый сотрудник, менее 2 нед.', N'Кладовщик',
        N'PICKTO', N'2021-09-15 10:00:00.000', 13, 44, 0.13762374224398982, 71.744, 13, N'2021-09-15 10:00',
        N'дневная смена', N'0.16', N'Не эффективная работа', N'2021-09-15');
INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Отбор', N'Иванов Иван Иванович', N'Staff', N'Новый сотрудник, менее 2 нед.', N'Кладовщик',
        N'SCONS03 (1 из 4)', N'2021-09-15 11:00:00.000', 5, 50, 0, 0, 5, N'2021-09-15 11:00', N'дневная смена', N'0.16',
        N'Не эффективная работа', N'2021-09-15');
INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Отбор', N'Иванов Иван Иванович', N'Staff', N'Новый сотрудник, менее 2 нед.', N'Кладовщик',
        N'PICKTO', N'2021-09-15 12:00:00.000', 29, 18, 0.07954801925432056, 17.2, 29, N'2021-09-15 12:00',
        N'дневная смена', N'0.16', N'Не эффективная работа', N'2021-09-15');
INSERT INTO dbo.vperfomance_history4 (whs,operation_group, "Сотрудник", "Staff/OutStaff", "Новый сотрудник",
                                      "Администратор", "Ячейка", d1, "Количество", "Время", ye, ye_abs, "Шт/час", "Час", "Смена",
                                      "YЕ за смену", "Статус эффективности", "Опер.день")
VALUES ('SOF',N'Отбор', N'Иванов Иван Иванович', N'Staff', N'Новый сотрудник, менее 2 нед.', N'Кладовщик',
        N'S22 (1 из 2)', N'2021-09-15 13:00:00.000', 6, 60, 0.025234285714285716, 17.664, 6, N'2021-09-15 13:00',
        N'дневная смена', N'0.16', N'Не эффективная работа', N'2021-09-15');
