export const correctionReasons = [
  {
    id: 1,
    name: 'Не согласен с прогнозом',
  },
  {
    id: 2,
    name: 'Незапланированное промо',
  },
  {
    id: 3,
    name: 'Отмена промо',
  },
  {
    id: 4,
    name: 'Экстренная закупка (снижение закупочных цен)',
  },
  {
    id: 5,
    name: 'Временное отсутствие товара у поставщика',
  },
  {
    id: 6,
    name: 'Товар снят с производства',
  },
  {
    id: 7,
    name: 'Сезонный товар',
  },
  {
    id: 8,
    name: 'Другое',
  },
  {
    id: 9,
    name: 'Объединение заявок',
  },
  {
    id: 10,
    name: 'Не согласен с safety stock',
  },
  {
    id: 11,
    name: 'Нулевой прогноз',
  },
  {
    id: 12,
    name: 'Добираем до минимального заказа, руб',
  },
  {
    id: 13,
    name: 'Округляем рекомендацию до кванта по договорённости с поставщиком',
  },
  {
    id: 14,
    name: 'Не учитываются упущенные продажи в рекомендации',
  },
  {
    id: 15,
    name: 'Stock cover < 28 дней',
  },
  {
    id: 16,
    name: 'Stock cover > 56 дней',
  },
];
