/* eslint-disable max-len */

import customDeals from './customDeals';

export default {
    entity: 'page',
    id: 49305,
    rev: 377428,
    type: 'navnode_touch',
    name: 'Хаб скидок тач (реактивная копия)',
    hasContextParams: true,
    links: [{entity: 'navnode', id: '61522'}, {entity: 'domain', id: 'ru'}, {
        entity: 'domain',
        id: 'by',
    }, {entity: 'domain', id: 'kz'}, {entity: 'domain', id: 'ua'}, {entity: 'nodeType', type: 'category'}],
    content: {
        entity: 'content',
        rows: [
            {
                entity: 'box',
                name: 'Grid12',
                props: {
                    type: 'row',
                    width: 'default',
                    layout: true,
                    grid: 1,
                },
                nodes: [
                    {
                        entity: 'box',
                        name: 'Grid12',
                        props: {
                            type: 'column',
                            layout: false,
                            width: 1,
                            position: 'default',
                            sticky: false,
                        },
                        nodes: [
                            {
                                resources: {
                                    garsons: [
                                        {
                                            params: {
                                                data: customDeals,
                                            },
                                            id: 'CustomDeals',
                                        },
                                    ],
                                },
                                id: 44858019,
                                name: 'CustomDealsFeed',
                                entity: 'widget',
                            },
                            {
                                props: {
                                    departments: [
                                        {
                                            skipHid: [
                                                '11911273',
                                            ],
                                            hid: '10613523,198118,91009,91597,90764,90402,90666,91512,90509,8475840,90813,91307,7877999,90719',
                                            title: 'Все категории',
                                        },
                                        {
                                            skipHid: [],
                                            hid: '198119',
                                            title: 'Электроника',
                                        },
                                        {
                                            skipHid: [],
                                            hid: '198118',
                                            title: 'Бытовая техника',
                                        },
                                        {
                                            skipHid: [],
                                            hid: '91009',
                                            title: 'Компьютерная техника',
                                        },
                                        {
                                            skipHid: [],
                                            hid: '91597',
                                            title: 'Строительство и ремонт',
                                        },
                                        {
                                            skipHid: [],
                                            hid: '90764',
                                            title: 'Детские товары',
                                        },
                                        {
                                            skipHid: [],
                                            hid: '90719',
                                            title: 'Дача, сад и огород',
                                        },
                                    ],
                                    promoTypes: [
                                        {
                                            id: 'market',
                                            name: 'Все',
                                        },
                                        {
                                            id: 'discount',
                                            name: 'Скидки',
                                        },
                                        {
                                            id: 'promo-code',
                                            name: 'Промокоды',
                                        },
                                        {
                                            id: 'n-plus-m',
                                            name: 'Больше за ту же цену',
                                        },
                                        {
                                            id: 'gift-with-purchase',
                                            name: 'Подарок за покупку',
                                        },
                                    ],
                                    title: 'Выгодно прямо сейчас',
                                },
                                id: 69361870,
                                name: 'DealsHubFilters',
                                entity: 'widget',
                            },
                            {
                                props: {
                                    title: 'Уточните, что именно вам нужно',
                                },
                                resources: {
                                    garsons: [
                                        {
                                            params: {
                                                data: [
                                                    {
                                                        hid: '198119',
                                                        categories: [
                                                            {
                                                                id: '91491',
                                                                nid: 54726,
                                                                title: 'Мобильные телефоны',
                                                            },
                                                            {
                                                                id: '90639',
                                                                nid: 59601,
                                                                title: 'Телевизоры',
                                                            },
                                                            {
                                                                id: '10498025',
                                                                nid: 56034,
                                                                title: 'Умные часы и браслеты',
                                                            },
                                                            {
                                                                id: '14369750',
                                                                nid: 71629,
                                                                title: 'Экшн-камеры',
                                                            },
                                                            {
                                                                id: '91122',
                                                                nid: 55304,
                                                                title: 'Игровые приставки',
                                                            },
                                                            {
                                                                id: '90555',
                                                                nid: 56179,
                                                                title: 'Наушники и Bluetooth-гарнитуры',
                                                            },
                                                            {
                                                                id: '2724669',
                                                                nid: 56181,
                                                                title: 'Портативная акустика',
                                                            },
                                                            {
                                                                id: '91148',
                                                                nid: 56199,
                                                                title: 'Фотоаппараты',
                                                            },
                                                            {
                                                                id: '14960839',
                                                                nid: 72029,
                                                                title: 'Игры для приставок и ПК',
                                                            },
                                                            {
                                                                id: '8353924',
                                                                nid: 56035,
                                                                title: 'Универсальные внешние аккумуляторы',
                                                            },
                                                            {
                                                                id: '90629',
                                                                nid: 56146,
                                                                title: 'Подставки и кронштейны',
                                                            },
                                                            {
                                                                id: '10972670',
                                                                nid: 59923,
                                                                title: 'Очки виртуальной реальности',
                                                            },
                                                            {
                                                                id: '15880008',
                                                                nid: 72934,
                                                                title: 'Ручные стабилизаторы и стедикамы',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '198118',
                                                        categories: [
                                                            {
                                                                id: '90589',
                                                                nid: 54942,
                                                                title: 'Кофеварки и кофемашины',
                                                            },
                                                            {
                                                                id: '15450081',
                                                                nid: 71587,
                                                                title: 'Холодильники',
                                                            },
                                                            {
                                                                id: '90566',
                                                                nid: 54913,
                                                                title: 'Стиральные машины',
                                                            },
                                                            {
                                                                id: '16336734',
                                                                nid: 16336735,
                                                                title: 'Фены и фен-щётки',
                                                            },
                                                            {
                                                                id: '16302536',
                                                                nid: 83798,
                                                                title: 'Роботы-пылесосы',
                                                            },
                                                            {
                                                                id: '90603',
                                                                nid: 54937,
                                                                title: 'Прочая кухонная техника',
                                                            },
                                                            {
                                                                id: '90575',
                                                                nid: 54971,
                                                                title: 'Водонагреватели',
                                                            },
                                                            {
                                                                id: '90578',
                                                                nid: 54976,
                                                                title: 'Кондиционеры',
                                                            },
                                                            {
                                                                id: '278374',
                                                                nid: 54926,
                                                                title: 'Электрические зубные щетки',
                                                            },
                                                            {
                                                                id: '237418',
                                                                nid: 58612,
                                                                title: 'Варочные панели',
                                                            },
                                                            {
                                                                id: '90580',
                                                                nid: 58611,
                                                                title: 'Духовые шкафы',
                                                            },
                                                            {
                                                                id: '90599',
                                                                nid: 54957,
                                                                title: 'Соковыжималки',
                                                            },
                                                            {
                                                                id: '765280',
                                                                nid: 54931,
                                                                title: 'Блендеры',
                                                            },
                                                            {
                                                                id: '4954975',
                                                                nid: 54951,
                                                                title: 'Мультиварки',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '91009',
                                                        categories: [
                                                            {
                                                                id: '91013',
                                                                nid: 54544,
                                                                title: 'Ноутбуки',
                                                            },
                                                            {
                                                                id: '6427100',
                                                                nid: 54545,
                                                                title: 'Планшеты',
                                                            },
                                                            {
                                                                id: '138608',
                                                                nid: 54546,
                                                                title: 'Принтеры и МФУ',
                                                            },
                                                            {
                                                                id: '91031',
                                                                nid: 55314,
                                                                title: 'Видеокарты',
                                                            },
                                                            {
                                                                id: '723088',
                                                                nid: 55335,
                                                                title: 'Комплекты клавиатур и мышей',
                                                            },
                                                            {
                                                                id: '723087',
                                                                nid: 71788,
                                                                title: 'Оборудование Wi-Fi и Bluetooth',
                                                            },
                                                            {
                                                                id: '91117',
                                                                nid: 55337,
                                                                title: 'Рули, джойстики, геймпады',
                                                            },
                                                            {
                                                                id: '16309374',
                                                                nid: 83823,
                                                                title: 'Внешние жесткие диски и SSD',
                                                            },
                                                            {
                                                                id: '91028',
                                                                nid: 55319,
                                                                title: 'Компьютерные корпуса',
                                                            },
                                                            {
                                                                id: '91032',
                                                                nid: 54535,
                                                                title: 'Карты памяти',
                                                            },
                                                            {
                                                                id: '191219',
                                                                nid: 55009,
                                                                title: 'Мультимедиа-проекторы',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '91597',
                                                        categories: [
                                                            {
                                                                id: '91650',
                                                                nid: 56413,
                                                                title: 'Шуруповерты',
                                                            },
                                                            {
                                                                id: '15221861',
                                                                nid: 71099,
                                                                title: 'Дрели и миксеры',
                                                            },
                                                            {
                                                                id: '284394',
                                                                nid: 55598,
                                                                title: 'Сварочные аппараты',
                                                            },
                                                            {
                                                                id: '11031138',
                                                                nid: 60003,
                                                                title: 'Входные двери',
                                                            },
                                                            {
                                                                id: '91599',
                                                                nid: 57727,
                                                                title: 'Краски',
                                                            },
                                                            {
                                                                id: '91610',
                                                                nid: 56379,
                                                                title: 'Смесители',
                                                            },
                                                            {
                                                                id: '91640',
                                                                nid: 57736,
                                                                title: 'Ламинат',
                                                            },
                                                            {
                                                                id: '6144238',
                                                                nid: 55583,
                                                                title: 'Домофоны',
                                                            },
                                                            {
                                                                id: '15448926',
                                                                nid: 71579,
                                                                title: 'Электро- и бензопилы цепные',
                                                            },
                                                            {
                                                                id: '91651',
                                                                nid: 56419,
                                                                title: 'Перфораторы',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '90764',
                                                        categories: [
                                                            {
                                                                id: '12410815',
                                                                nid: 61506,
                                                                title: 'Квадрокоптеры',
                                                            },
                                                            {
                                                                id: '10470548',
                                                                nid: 59749,
                                                                title: 'Конструкторы',
                                                            },
                                                            {
                                                                id: '90799',
                                                                nid: 16413441,
                                                                title: 'Подгузники',
                                                            },
                                                            {
                                                                id: '10682618',
                                                                nid: 59702,
                                                                title: 'Роботы и трансформеры',
                                                            },
                                                            {
                                                                id: '10682647',
                                                                nid: 59742,
                                                                title: 'Настольные игры',
                                                            },
                                                            {
                                                                id: '10683251',
                                                                nid: 59720,
                                                                title: 'Беговелы',
                                                            },
                                                            {
                                                                id: '13360765',
                                                                nid: 65504,
                                                                title: 'Детское пюре',
                                                            },
                                                            {
                                                                id: '10682550',
                                                                nid: 59733,
                                                                title: 'Куклы и пупсы',
                                                            },
                                                            {
                                                                id: '13360751',
                                                                nid: 16405139,
                                                                title: 'Молочные смеси',
                                                            },
                                                            {
                                                                id: '10682610',
                                                                nid: 59699,
                                                                title: 'Мягкие игрушки',
                                                            },
                                                            {
                                                                id: '14808696',
                                                                nid: 70060,
                                                                title: 'Радиоуправляемые игрушки',
                                                            },
                                                            {
                                                                id: '512743',
                                                                nid: 55063,
                                                                title: 'Автокресла',
                                                            },
                                                            {
                                                                id: '13858259',
                                                                nid: 67092,
                                                                title: '13858259',
                                                            },
                                                            {
                                                                id: '10683235',
                                                                nid: 59723,
                                                                title: 'Игровые и спортивные комплексы и горки',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '90719',
                                                        categories: [
                                                            {
                                                                id: '281935',
                                                                nid: 55089,
                                                                title: 'Мойки высокого давления',
                                                            },
                                                            {
                                                                id: '15646095',
                                                                nid: 71963,
                                                                title: 'Газонокосилки',
                                                            },
                                                            {
                                                                id: '15646187',
                                                                nid: 71965,
                                                                title: 'Триммеры',
                                                            },
                                                            {
                                                                id: '267389',
                                                                nid: 56237,
                                                                title: 'Мотоблоки и культиваторы',
                                                            },
                                                            {
                                                                id: '5017483',
                                                                nid: 55088,
                                                                title: 'Грили, барбекю, коптильни',
                                                            },
                                                            {
                                                                id: '14137164',
                                                                nid: 67921,
                                                                title: 'Мангалы',
                                                            },
                                                            {
                                                                id: '4943489',
                                                                nid: 55099,
                                                                title: 'Теплицы и каркасы',
                                                            },
                                                            {
                                                                id: '13771450',
                                                                nid: 66304,
                                                                title: 'Садовые качели',
                                                            },
                                                            {
                                                                id: '10683243',
                                                                nid: 59719,
                                                                title: 'Сборные и надувные бассейны',
                                                            },
                                                            {
                                                                id: '13793401',
                                                                nid: 66605,
                                                                title: 'Шланги и комплекты для полива',
                                                            },
                                                            {
                                                                id: '13793838',
                                                                nid: 66639,
                                                                title: 'Семена овощей, фруктов и трав',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '90666',
                                                        categories: [
                                                            {
                                                                id: '90688',
                                                                nid: 55082,
                                                                title: 'Стиральный порошок',
                                                            },
                                                            {
                                                                id: '90713',
                                                                nid: 55150,
                                                                title: 'Лампочки',
                                                            },
                                                            {
                                                                id: '1031249',
                                                                nid: 55142,
                                                                title: 'Надувная мебель',
                                                            },
                                                            {
                                                                id: '90698',
                                                                nid: 56276,
                                                                title: 'Сковороды и сотейники',
                                                            },
                                                            {
                                                                id: '13196790',
                                                                nid: 64993,
                                                                title: 'Средства для посудомоечных машин',
                                                            },
                                                            {
                                                                id: '90703',
                                                                nid: 55132,
                                                                title: 'Турки, кофеварки, кофемолки',
                                                            },
                                                            {
                                                                id: '12894144',
                                                                nid: 63058,
                                                                title: 'Одеяла',
                                                            },
                                                            {
                                                                id: '1003092',
                                                                nid: 55139,
                                                                title: 'Матрасы',
                                                            },
                                                            {
                                                                id: '90690',
                                                                nid: 54502,
                                                                title: 'Средства против насекомых',
                                                            },
                                                            {
                                                                id: '12894020',
                                                                nid: 63048,
                                                                title: 'Комплекты',
                                                            },
                                                            {
                                                                id: '10785222',
                                                                nid: 59883,
                                                                title: 'Компьютерные стулья и кресла',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '91512',
                                                        categories: [
                                                            {
                                                                id: '91529',
                                                                nid: 55939,
                                                                title: 'Велосипеды для взрослых и детей',
                                                            },
                                                            {
                                                                id: '91522',
                                                                nid: 59769,
                                                                title: 'Рюкзаки спортивные и городские',
                                                            },
                                                            {
                                                                id: '15032315',
                                                                nid: 70890,
                                                                title: 'Ножи и мультитулы',
                                                            },
                                                            {
                                                                id: '14247341',
                                                                nid: 68159,
                                                                title: 'Протеины',
                                                            },
                                                            {
                                                                id: '10859406',
                                                                nid: 59919,
                                                                title: 'Каркасные батуты',
                                                            },
                                                            {
                                                                id: '91525',
                                                                nid: 56006,
                                                                title: 'Беговые дорожки',
                                                            },
                                                            {
                                                                id: '91519',
                                                                nid: 56016,
                                                                title: 'Палатки туристические',
                                                            },
                                                            {
                                                                id: '12907256',
                                                                nid: 64250,
                                                                title: 'Моноколеса и гироскутеры',
                                                            },
                                                            {
                                                                id: '14247369',
                                                                nid: 68161,
                                                                title: 'Аминокислоты и BCAA',
                                                            },
                                                            {
                                                                id: '7070735',
                                                                nid: 54700,
                                                                title: 'Самокаты',
                                                            },
                                                            {
                                                                id: '936953',
                                                                nid: 56018,
                                                                title: 'Походная мебель',
                                                            },
                                                            {
                                                                id: '91521',
                                                                nid: 55954,
                                                                title: 'Надувные лодки',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '90509',
                                                        categories: [
                                                            {
                                                                id: '15927546',
                                                                nid: 73038,
                                                                title: 'Парфюмерия',
                                                            },
                                                            {
                                                                id: '13334231',
                                                                nid: 65461,
                                                                title: 'Зубная паста',
                                                            },
                                                            {
                                                                id: '8476097',
                                                                nid: 57357,
                                                                title: 'Маски для лица',
                                                            },
                                                            {
                                                                id: '13239503',
                                                                nid: 65316,
                                                                title: 'Лаки и спреи для укладки волос',
                                                            },
                                                            {
                                                                id: '14990285',
                                                                nid: 70784,
                                                                title: 'Средства для ухода за бородой и усами',
                                                            },
                                                            {
                                                                id: '8476103',
                                                                nid: 57360,
                                                                title: 'Средства для загара и защиты от солнца для лица',
                                                            },
                                                            {
                                                                id: '14994593',
                                                                nid: 70802,
                                                                title: 'Мужские бритвы и лезвия',
                                                            },
                                                            {
                                                                id: '91183',
                                                                nid: 57352,
                                                                title: 'Шампуни для волос',
                                                            },
                                                            {
                                                                id: '8475955',
                                                                nid: 57375,
                                                                title: 'Кремы и лосьоны для тела',
                                                            },
                                                            {
                                                                id: '4748057',
                                                                nid: 57332,
                                                                title: 'Губная помада',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '8475840',
                                                        categories: [
                                                            {
                                                                id: '90533',
                                                                nid: 57659,
                                                                title: 'Контактные линзы',
                                                            },
                                                            {
                                                                id: '13077405',
                                                                nid: 64850,
                                                                title: 'Лекарственные препараты и БАДы',
                                                            },
                                                            {
                                                                id: '90539',
                                                                nid: 57953,
                                                                title: 'Тонометры',
                                                            },
                                                            {
                                                                id: '1009490',
                                                                nid: 57654,
                                                                title: 'Медицинские ингаляторы',
                                                            },
                                                            {
                                                                id: '90523',
                                                                nid: 56061,
                                                                title: 'Компрессионный трикотаж',
                                                            },
                                                            {
                                                                id: '90521',
                                                                nid: 56056,
                                                                title: 'Витамины и минералы',
                                                            },
                                                            {
                                                                id: '15756357',
                                                                nid: 72456,
                                                                title: 'Средства для лечения гриппа и простуды',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '91307',
                                                        categories: [
                                                            {
                                                                id: '15368134',
                                                                nid: 71577,
                                                                title: 'Капсулы для кофемашин',
                                                            },
                                                            {
                                                                id: '91335',
                                                                nid: 55785,
                                                                title: 'Масло растительное',
                                                            },
                                                            {
                                                                id: '15726400',
                                                                nid: 72278,
                                                                title: 'Вода',
                                                            },
                                                            {
                                                                id: '16044621',
                                                                nid: 73608,
                                                                title: 'Кофе в зернах',
                                                            },
                                                            {
                                                                id: '91392',
                                                                nid: 55897,
                                                                title: 'Чай',
                                                            },
                                                            {
                                                                id: '16011677',
                                                                nid: 73478,
                                                                title: 'Шоколадная плитка',
                                                            },
                                                            {
                                                                id: '15714105',
                                                                nid: 72095,
                                                                title: 'Шоколадные яйца и фигурный шоколад',
                                                            },
                                                            {
                                                                id: '13337703',
                                                                nid: 73802,
                                                                title: 'Готовые завтраки, мюсли, гранола',
                                                            },
                                                            {
                                                                id: '15720388',
                                                                nid: 72252,
                                                                title: 'Молочные и функциональные напитки',
                                                            },
                                                            {
                                                                id: '16044387',
                                                                nid: 73602,
                                                                title: 'Молотый кофе',
                                                            },
                                                            {
                                                                id: '91331',
                                                                nid: 55781,
                                                                title: 'Каши',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '90813',
                                                        categories: [
                                                            {
                                                                id: '15685457',
                                                                nid: 71971,
                                                                title: 'Корма для кошек',
                                                            },
                                                            {
                                                                id: '15685787',
                                                                nid: 71973,
                                                                title: 'Корма для собак',
                                                            },
                                                            {
                                                                id: '4922657',
                                                                nid: 55103,
                                                                title: 'Витамины и добавки для кошек и собак',
                                                            },
                                                            {
                                                                id: '12714755',
                                                                nid: 62171,
                                                                title: 'Лежаки, домики, спальные места',
                                                            },
                                                            {
                                                                id: '12718255',
                                                                nid: 62200,
                                                                title: 'Миски, кормушки и поилки',
                                                            },
                                                            {
                                                                id: '12714763',
                                                                nid: 62173,
                                                                title: 'Транспортировка, переноски для животных',
                                                            },
                                                            {
                                                                id: '12704731',
                                                                nid: 62167,
                                                                title: 'Ошейники для собак',
                                                            },
                                                            {
                                                                id: '12718081',
                                                                nid: 62196,
                                                                title: 'Груминг, инструменты для ухода за домашними животными',
                                                            },
                                                            {
                                                                id: '605794',
                                                                nid: 56245,
                                                                title: 'Аквариумы',
                                                            },
                                                            {
                                                                id: '12766642',
                                                                nid: 62213,
                                                                title: 'Наполнители для кошачьих туалетов',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '7877999',
                                                        categories: [
                                                            {
                                                                id: '7814994',
                                                                nid: 57427,
                                                                title: 'Женские кроссовки и кеды',
                                                            },
                                                            {
                                                                id: '7815007',
                                                                nid: 57444,
                                                                title: 'Мужские кроссовки и кеды',
                                                            },
                                                            {
                                                                id: '7812201',
                                                                nid: 55649,
                                                                title: 'Сумки',
                                                            },
                                                            {
                                                                id: '7812207',
                                                                nid: 55651,
                                                                title: 'Чемоданы',
                                                            },
                                                            {
                                                                id: '91259',
                                                                nid: 54618,
                                                                title: 'Наручные часы',
                                                            },
                                                            {
                                                                id: '7811901',
                                                                nid: 57297,
                                                                title: 'Женские платья',
                                                            },
                                                            {
                                                                id: '7811945',
                                                                nid: 57282,
                                                                title: 'Женские куртки',
                                                            },
                                                            {
                                                                id: '7812186',
                                                                nid: 57390,
                                                                title: 'Мужские куртки',
                                                            },
                                                        ],
                                                    },
                                                    {
                                                        hid: '90402',
                                                        categories: [
                                                            {
                                                                id: '90490',
                                                                nid: 54469,
                                                                title: 'Автомобильные шины',
                                                            },
                                                            {
                                                                id: '166068',
                                                                nid: 54461,
                                                                title: 'Колесные диски',
                                                            },
                                                            {
                                                                id: '90478',
                                                                nid: 54795,
                                                                title: 'Моторные масла',
                                                            },
                                                            {
                                                                id: '6269371',
                                                                nid: 54804,
                                                                title: 'Автомобильные видеорегистраторы',
                                                            },
                                                            {
                                                                id: '90462',
                                                                nid: 54822,
                                                                title: 'Радар-детекторы автомобильные',
                                                            },
                                                            {
                                                                id: '90404',
                                                                nid: 54836,
                                                                title: 'Автомагнитолы',
                                                            },
                                                            {
                                                                id: '308016',
                                                                nid: 54835,
                                                                title: 'Автомобильная акустика',
                                                            },
                                                            {
                                                                id: '90474',
                                                                nid: 54806,
                                                                title: 'Автомобильные багажники, рейлинги',
                                                            },
                                                            {
                                                                id: '14405299',
                                                                nid: 69083,
                                                                title: 'Лампы для автомобилей',
                                                            },
                                                        ],
                                                    },
                                                ],
                                            },
                                            id: 'CustomPromoCategories',
                                        },
                                    ],
                                },
                                id: '44875688',
                                name: 'ClarifyPromoCategory',
                                entity: 'widget',
                            },
                            {
                                name: 'MobileRoll',
                                loadMode: 'default',
                                entity: 'widget',
                                props: {
                                    titleStyle: 'dealsHub',
                                    showTrustElement: true,
                                    paddingLeft: 'none',
                                    paddingTop: 'none',
                                    pageCount: 12,
                                    paddingBottom: 'none',
                                    showMoreButton: true,
                                    trustElementText: 'Здесь мы показываем только лучшие цены на товары',
                                    paddingRight: 'none',
                                    feedTheme: 'white',
                                    snippets: {
                                        withTitle: true,
                                        withCategory: false,
                                        withoutSnippetPreview: true,
                                        withPrice: true,
                                        priceFirst: false,
                                        theme: 'whitePromo',
                                        shade: false,
                                        useDefaultOffer: true,
                                        flexible: false,
                                        type: 'default',
                                        discountBadgeType: 'default',
                                    },
                                },
                                id: 62200836,
                                resources: {
                                    garsons: [
                                        {
                                            count: 9999,
                                            params: {
                                                'promo-type': 'market',
                                                'skipHids': [],
                                                'has-promo': '1',
                                                'use-default-offers': '1',
                                                'hide-offer-promo': '0',
                                                'onstock': true,
                                                'hid': '90533,13077405,8476097,91335,15726400,16044621,15685457,15685787,15553892,90569,90584,15450081,90589,90566,90490,166068,90478,91650,7814994,7815007,12410815,10470548,91031,91019,138608,91013,90639,91122,91491,10498025,14369750,91529,90539,15927546,15368134,15714102,90688,12714763,90586,278374,90599,90404,308016,5017483,13771450,6504970,15646095,10683243,15646187,281935,267389,91610,763072,284394,15448926,91651,12894143,1031249,12499575,90698,7812201,7812207,91259,10682618,10682647,6159024,10683251,12907256,14247341,14247369,7070735,13314877,14996686,14990285,13239503,13239135,14993676,91183,8476099,90565,16302537,16302536,90578,765280,90588,90567,90463,6269371,90462,91599,90713,13360765,10682550,13360751,90799,989023,12382295,6427100,14334315,723088,91052,14333188,90548,90555,2724669,15880008,91148,91519,90534,8480722,13776946,13776757,15356747,10682659,10682629,91011,1564516,91635,91611,90690,12894020,91517,454910,13199962,13792611,14868726,989025,10790731,989026,16053627',
                                                'not-check-min-price-hids': [],
                                                'allow-collapsing': '1',
                                                'promo-check-min-price': 3,
                                                'glfilter': [],
                                            },
                                            id: 'PrimeSearch',
                                        },
                                    ],
                                },
                            },
                            {
                                props: {
                                    offsetToShow: 1000,
                                },
                                id: 62200850,
                                name: 'ScrollToTop',
                                entity: 'widget',
                            },
                        ],
                    },
                ],
            },
        ],
    },
};

/* eslint-enable max-len */
