module.exports = {
    type: 'wizard',
    request_text: 'сколько карат в грамме',
    data_stub: [
        {
            type: 'units_converter',
            wizplace: 'upper',
            data: {
                srcName: '-1',
                data: {
                    t: [
                        {
                            id: '12',
                            nm: 'времени'
                        },
                        {
                            id: '5',
                            nm: 'геометрического угла'
                        },
                        {
                            id: '3',
                            nm: 'давления'
                        },
                        {
                            id: '2',
                            nm: 'длины'
                        },
                        {
                            id: '6',
                            nm: 'массы',
                            uv: [
                                {
                                    i: '41',
                                    n1: 'миллиграмм'
                                },
                                {
                                    i: '47',
                                    n1: 'карат'
                                },
                                {
                                    i: '42',
                                    n1: 'грамм'
                                },
                                {
                                    i: '128',
                                    n1: 'тройская унция'
                                },
                                {
                                    i: '40',
                                    n1: 'килограмм'
                                },
                                {
                                    i: '46',
                                    n1: 'центнер'
                                },
                                {
                                    i: '45',
                                    n1: 'тонна'
                                },
                                {
                                    i: '44',
                                    n1: 'русский фунт'
                                },
                                {
                                    i: '39',
                                    n1: 'пуд'
                                },
                                {
                                    i: '48',
                                    n1: 'унция'
                                },
                                {
                                    i: '43',
                                    n1: 'английский фунт'
                                }
                            ],
                            s: {
                                it: [
                                    {
                                        i: '42',
                                        v: '1000'
                                    },
                                    {
                                        i: '40',
                                        v: '1000000'
                                    },
                                    {
                                        i: '45',
                                        v: '1000000000'
                                    },
                                    {
                                        i: '46',
                                        v: '100000000'
                                    },
                                    {
                                        i: '47',
                                        v: '200'
                                    },
                                    {
                                        i: '48',
                                        v: '28349.523125'
                                    },
                                    {
                                        i: '128',
                                        v: '31103.4768'
                                    },
                                    {
                                        i: '39',
                                        v: '16380000'
                                    },
                                    {
                                        i: '43',
                                        v: '453592.37'
                                    },
                                    {
                                        i: '44',
                                        v: '409500'
                                    }
                                ],
                                bs: '41'
                            }
                        },
                        {
                            id: '10',
                            nm: 'мощности'
                        },
                        {
                            id: '9',
                            nm: 'объема'
                        },
                        {
                            id: '7',
                            nm: 'объема информации'
                        },
                        {
                            id: '8',
                            nm: 'площади'
                        },
                        {
                            id: '11',
                            nm: 'расхода топлива'
                        },
                        {
                            id: '13',
                            nm: 'скорости'
                        },
                        {
                            id: '1',
                            nm: 'температуры'
                        },
                        {
                            id: '4',
                            nm: 'энергии'
                        }
                    ]
                },
                fromVal: '1',
                toVal: '5',
                category: '6',
                fromName: '42',
                fromNameReadable: 'грамм',
                shortFromReadableName: 'граммы',
                toName: '47',
                toNameReadable: 'карат',
                toShortReadableName: 'караты'
            },
            counter_prefix: '/wiz/converter/units/',
            types: {
                kind: 'wizard'
            }
        }
    ]
};
