INSERT INTO dbo.vperfomance_DICT ("ABS одного уе", operation_nmb, "Операция", "Участок",
                                  "Данные для расчета", "Единица измерения", "Расчет по часам", "УЕ штуки/НЗН",
                                  "УЕ товаров с СГ", "УЕ посылки", "УЕ СКУ", "УЕ Ячейки", "БО staff", WHS)
VALUES (4048, N'3', N'Паллетная приемка стандартная', N'Приемка', N'itrn', N'палл', 0,
        N'12.3', null, null, null, null, N'0', 'SOF');

INSERT INTO dbo.vperfomance_DICT ("ABS одного уе", operation_nmb, "Операция", "Участок",
                                  "Данные для расчета", "Единица измерения", "Расчет по часам", "УЕ штуки/НЗН",
                                  "УЕ товаров с СГ", "УЕ посылки", "УЕ СКУ", "УЕ Ячейки", "БО staff", WHS)
VALUES (4048, N'30', N'КОМПРЕССИЯ', N'Компрессия', null, N'час',
        1, N'368', null, null, null, null, N'47.27', 'SOF');
