/* eslint quote-props: 0 */
'use strict';

var data = {
    '': ['', '', [], { suggestions: [] }],
    'аэрофлот': [
        'аэрофлот',
        'аэрофлот',
        [
            ['аэрофлот официальный', 1.22654e-05, { tpah: [9, 9, 20] }],
            ['аэрофлот официальный сайт', 4.26002e-06, { tpah: [9, 9, 20] }],
            ['аэрофлот регистрация', 1.84009e-06, { tpah: [9, 9, 20] }],
            ['аэрофлот бонус', 1.49142e-06, { tpah: [9, 9, 14] }]
        ],
        [
            'nav',
            '«Аэрофлот» — российская авиакомпания',
            '«Аэрофлот» — российская авиакомпания',
            'mobile.aeroflot.ru',
            'http:\/\/yandex.ru\/clck\/jsredir?text=%D0%B0%D1%8D%D1%80%D0%BE%D1%84%D0%BB%D0%BE%D1%82&from=yandex.ru' +
            '%3Bsuggest%3Bweb&state=dtype%3Dstred%2Fpid%3D1%2Fcid%3D71613%2Fpart%3D%25D0%25B0%25D1%258D%25D1%2580%2' +
            '5D0%25BE%25D1%2584%25D0%25BB%25D0%25BE%25D1%2582%2Fsuggestion%3D%25D0%25B0%25D1%258D%25D1%2580%25D0%25' +
            'BE%25D1%2584%25D0%25BB%25D0%25BE%25D1%2582%2Fregion%3D11119%2F%2A&data=url%3Dhttp%253A%252F%252Fmobile' +
            '.aeroflot.ru%26ts%3D1492009015%26uid%3D6678960901486125134&sign=0b18fb3f83148a71398c80d3c54aa147&ref=h' +
            'ttps%3A%2F%2Flocal.yandex.ru%3A3443%2Fsearch%2Ftouch%2F%3Ftext%3D%25D0%25B0%25D1%258D%25D1%2580%25D0%2' +
            '5BE%25D1%2584%25D0%25BB%25D0%25BE%25D1%2582&keyno=0&l10n=ru'
        ],
        {
            suggestions: [
                ['аэрофлот официальный сайт билеты на самолет', 3.266013437e-06, { src: 'B' }],
                ['аэрофлот онлайн регистрация', 1.112337941e-06, { src: 'B' }],
                ['аэрофлот регистрация онлайн', 6.21252525e-07, { src: 'B' }],
                ['аэрофлот казань москва расписание', 5.325021561e-07, { src: 'B' }],
                ['аэрофлот официальный сайт билеты', 4.9700202e-07, { src: 'B' }]
            ]
        }
    ],
    'аэрофлот официальный ': [
        'аэрофлот официальный ',
        'аэрофлот официальный сайт',
        [
            ['аэрофлот официальный сайт', 1.69491e-05, { tpah: [21, 21, 25] }],
            ['аэрофлот официальный сайт билеты', 3.94654e-06, { tpah: [21, 21, 25] }],
            ['аэрофлот официальный регистрация', 2.30751e-07, { tpah: [21, 21, 32] }],
            ['аэрофлот официальный билеты', 1.42001e-07, { tpah: [21, 21, 27] }]
        ],
        {
            suggestions: [
                ['аэрофлот официальный сайт билеты на самолет', 3.266013437e-06, { src: 'B' }],
                ['аэрофлот официальный сайт билеты на самолет купить аэрофлот', 1.53833966e-07, { src: 'B' }],
                ['аэрофлот официальный сайт регистрация на рейс онлайн', 1.360838979e-07, { src: 'B' }],
                ['аэрофлот официальный сайт цены на билеты акции для пенсионеров', 8.875036173e-08, { src: 'B' }],
                ['аэрофлот официальный сайт регистрация', 8.283367237e-08, { src: 'B' }]
            ]
        }
    ],
    'аэрофлот официальный': [
        'аэрофлот официальный',
        'аэрофлот официальный сайт',
        [
            ['аэрофлот официальный сайт', 1.6949e-05, { tpah: [21, 21, 25] }],
            ['аэрофлот официальный сайт билеты', 3.94643e-06, { tpah: [21, 21, 25] }],
            ['аэрофлот официальный регистрация', 2.30751e-07, { tpah: [21, 21, 32] }],
            ['аэрофлот официальный билеты', 1.42001e-07, { tpah: [21, 21, 27] }]
        ],
        [
            'nav',
            '«Аэрофлот» — российская авиакомпания',
            '«Аэрофлот» — российская авиакомпания',
            'mobile.aeroflot.ru',
            'http:\/\/yandex.ru\/clck\/jsredir?text=%D0%B0%D1%8D%D1%80%D0%BE%D1%84%D0%BB%D0%BE%D1%82%20%D0%BE%D1%84' +
            '%D0%B8%D1%86%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9%20%D1%81%D0%B0%D0%B9%D1%82&from=yandex.ru%3B' +
            'suggest%3Bweb&state=dtype%3Dstred%2Fpid%3D1%2Fcid%3D71613%2Fpart%3D%25D0%25B0%25D1%258D%25D1%2580%25D0' +
            '%25BE%25D1%2584%25D0%25BB%25D0%25BE%25D1%2582%2520%25D0%25BE%25D1%2584%25D0%25B8%25D1%2586%25D0%25B8' +
            '%25D0%25B0%25D0%25BB%25D1%258C%25D0%25BD%25D1%258B%25D0%25B9%2Fsuggestion%3D%25D0%25B0%25D1%258D%25D1' +
            '%2580%25D0%25BE%25D1%2584%25D0%25BB%25D0%25BE%25D1%2582%2520%25D0%25BE%25D1%2584%25D0%25B8%25D1%2586' +
            '%25D0%25B8%25D0%25B0%25D0%25BB%25D1%258C%25D0%25BD%25D1%258B%25D0%25B9%2520%25D1%2581%25D0%25B0%25D0' +
            '%25B9%25D1%2582%2Fregion%3D11119%2F%2A&data=url%3Dhttp%253A%252F%252Fmobile.aeroflot.ru%26ts' +
            '%3D1492011351%26uid%3D6678960901486125134&sign=496c2759390856352aa5627cd66154e6&ref=https%3A%2F%2F' +
            'local.yandex.ru%3A3443%2Fsearch%2Ftouch%2F%3Ftext%3D%25D0%25B0%25D1%258D%25D1%2580%25D0%25BE%25D1' +
            '%2584%25D0%25BB%25D0%25BE%25D1%2582%26lr%3D121642%26noredirect%3D1%26suggest_reqid' +
            '%3D40721953610155281712662513933698&keyno=0&l10n=ru'],
        {
            suggestions: [
                ['аэрофлот официальный сайт билеты на самолет', 3.266013437e-06, { src: 'B' }],
                ['аэрофлот официальный сайт билеты на самолет купить аэрофлот', 1.53833966e-07, { src: 'B' }],
                ['аэрофлот официальный сайт регистрация на рейс онлайн', 1.360838979e-07, { src: 'B' }],
                ['аэрофлот официальный сайт цены на билеты акции для пенсионеров', 8.875036173e-08, { src: 'B' }],
                ['аэрофлот официальный сайт регистрация', 8.283367237e-08, { src: 'B' }]
            ]
        }
    ],
    'погода в мо': [
        'погода в мо',
        'погода в мо',
        [
            ['погода в москве', 6.12012e-05, { tpah: [9, 11, 15] }],
            ['погода в москве на неделю', 1.35433e-05, { tpah: [9, 11, 15] }],
            ['погода в можге', 6.15336e-07, { tpah: [9, 11, 14] }],
            ['погода в молькеево', 4.67419e-07, { tpah: [9, 11, 18] }]
        ],
        ['fact', 'погода в москве', '+5 °C'],
        {
            suggestions: [
                ['погода в мо', 1000.946314, { src: 'Pers' }],
                ['погода в москве на неделю точный прогноз', 1.366755555e-06, { src: 'B' }],
                ['погода в москве снегопад сегодня', 4.200850583e-07, { src: 'B' }],
                ['погода в москве на 14 дней от гидрометцентра', 3.372513788e-07, { src: 'B' }],
                ['погода в москве на неделю от гидрометцентра', 3.017512427e-07, { src: 'B' }]
            ]
        }
    ],
    'а': [
        'а',
        'авито',
        [
            ['авито', 0.00411616, { tpah: [0, 1, 5] }],
            ['авито казань', 0.00156792, { tpah: [0, 1, 5] }],
            ['алфавит', 0.0005035, { tpah: [0, 1, 7] }],
            ['алиэкспресс', 0.000447308, { tpah: [0, 1, 11] }]],
        [
            'nav',
            '«Avito.ru» — бесплатные объявления',
            '«Avito.ru» — бесплатные объявления',
            'm.avito.ru',
            'http:\/\/yandex.ru\/clck\/jsredir?text=%D0%B0%D0%B2%D0%B8%D1%82%D0%BE&from=yandex.ru%3Bsuggest%3Bweb&' +
            'state=dtype%3Dstred%2Fpid%3D1%2Fcid%3D71613%2Fpart%3D%25D0%25B0%2Fsuggestion%3D%25D0%25B0%25D0%25B2%25D0' +
            '%25B8%25D1%2582%25D0%25BE%2Fregion%3D11119%2F%2A&data=url%3Dhttp%253A%252F%252Fm.avito.ru%26ts%3D1492010' +
            '640%26uid%3D6678960901486125134&sign=4230967262bdf6651d92c738f522c30c&ref=https%3A%2F%2Flocal.yandex.ru' +
            '%3A3443%2Fsearch%2Ftouch%2F%3Ftext%3D%25D0%25B0%25D1%258D%25D1%2580%25D0%25BE%25D1%2584%25D0%25BB%25D0' +
            '%25BE%25D1%2582&keyno=0&l10n=ru'
        ],
        {
            suggestions: [
                ['алфавит латиница', 0.0005024999846, { src: 'Fast' }],
                ['авито набережные челны', 0.0004303860187, { src: 'B' }],
                ['авито нижнекамск', 0.0002157639683, { src: 'B' }],
                ['ак барс онлайн', 0.0001710160286, { src: 'B' }],
                ['авито альметьевск', 0.0001581886463, { src: 'B' }]
            ]
        }
    ],
    'аэрофло': [
        'аэрофло',
        'аэрофлот',
        [
            ['аэрофлот', 4.88222e-05, { tpah: [0, 7, 8] }],
            ['аэрофлот официальный', 1.22654e-05, { tpah: [0, 7, 8] }],
            ['аэрофлот регистрация', 1.84009e-06, { tpah: [0, 7, 8] }],
            ['аэрофлоу', 2.09053e-10, { tpah: [0, 7, 8] }]
        ],
        [
            'nav',
            '«Аэрофлот» — российская авиакомпания',
            '«Аэрофлот» — российская авиакомпания',
            'mobile.aeroflot.ru',
            'http:\/\/yandex.ru\/clck\/jsredir?text=%D0%B0%D1%8D%D1%80%D0%BE%D1%84%D0%BB%D0%BE%D1%82&from=yandex.ru' +
            '%3Bsuggest%3Bweb&state=dtype%3Dstred%2Fpid%3D1%2Fcid%3D71613%2Fpart%3D%25D0%25B0%25D1%258D%25D1%2580' +
            '%25D0%25BE%25D1%2584%25D0%25BB%25D0%25BE%2Fsuggestion%3D%25D0%25B0%25D1%258D%25D1%2580%25D0%25BE%25D1' +
            '%2584%25D0%25BB%25D0%25BE%25D1%2582%2Fregion%3D11119%2F%2A&data=url%3Dhttp%253A%252F%252Fmobile.aeroflot' +
            '.ru%26ts%3D1492010871%26uid%3D6678960901486125134&sign=86a360c7be921cd11d49ada794578d74&ref=https%3A%2F' +
            '%2Flocal.yandex.ru%3A3443%2Fsearch%2Ftouch%2F%3Ftext%3D%25D0%25B0%25D1%258D%25D1%2580%25D0%25BE%25D1' +
            '%2584%25D0%25BB%25D0%25BE%25D1%2582&keyno=0&l10n=ru'
        ],
        {
            suggestions: [
                ['аэрофлот', 1000.999998, { src: 'Pers' }],
                ['аэрофлот официальный сайт билеты на самолет', 3.266013437e-06, { src: 'B' }],
                ['аэрофлот онлайн регистрация', 1.112337941e-06, { src: 'B' }],
                ['аэрофлот регистрация онлайн', 6.21252525e-07, { src: 'B' }],
                ['аэрофлот казань москва расписание', 5.325021561e-07, { src: 'B' }]
            ]
        }
    ],
    'погода ': [
        'погода ',
        'погода в мо',
        [
            ['погода в казани', 0.00111327, { tpah: [7, 7, 8] }],
            ['погода в набережных', 0.000312236, { tpah: [7, 7, 8] }],
            ['погода в набережных челнах', 0.000312236, { tpah: [7, 7, 8] }],
            ['погода в нижнекамске', 0.000192239, { tpah: [7, 7, 8] }]
        ],
        ['fact', 'погода', '+11 °C'],
        {
            suggestions: [
                ['погода в мо', 1000.946134, { src: 'Pers' }],
                ['погода в казани на месяц апрель 2017', 4.202033961e-05, { src: 'B' }],
                ['погода в чебоксарах на неделю', 1.254338486e-06, { src: 'B' }],
                ['погода в санкт-петербурге на неделю', 1.05317099e-06, { src: 'B' }],
                ['погода в нижнем новгороде на 14 дней', 8.165033591e-07, { src: 'B' }]
            ]
        }
    ],
    'погода в казаода': ['погода в казаода', '', [], { suggestions: [] }],
    'п': [
        'п',
        'пассажиры фильм 2016',
        [
            ['полицейский с рублёвки', 0, { tpah: [0, 1, 11] }],
            ['приколы', 0, { tpah: [0, 1, 7] }],
            ['песни', 0, { tpah: [0, 1, 5] }],
            ['привет', 0, { tpah: [0, 1, 6] }]
        ],
        {
            'suggestions': [
                ['пассажиры фильм 2016', 0, { src: 'Pers' }],
                ['полицейский с рублёвки новогодний беспредел фильм 2018', 0, { src: 'B' }],
                ['после фильм 2019', 0, { src: 'B' }],
                ['привет андрей передача с малаховым последний выпуск', 0, { src: 'B' }],
                ['подкидыш сериал', 0, { src: 'B' }]
            ]
        }
    ],
    'по': [
        'по',
        'по r',
        [
            ['полицейский с рублёвки', 0, { tpah: [0, 2, 11] }],
            ['последний', 0, { tpah: [0, 2, 9] }],
            ['после фильм 2019', 0, { tpah: [0, 2, 5] }],
            ['подкидыш сериал', 0, { tpah: [0, 2, 8] }]
        ],
        {
            'suggestions': [
                ['по r', 0, { src: 'Pers' }],
                ['полицейский с рублёвки новогодний беспредел фильм 2018', 0, { src: 'B' }],
                ['последний герой 2019', 0, { src: 'B' }],
                ['полицейский с рублёвки новогодний беспредел', 0, { src: 'B' }],
                ['поззи', 0, { src: 'B' }]
            ]
        }
    ],
    'пог': [
        'пог',
        'погода',
        [
            ['погода', 0, { tpah: [0, 3, 6] }],
            ['погоня', 0, { tpah: [0, 3, 6] }],
            ['погода в москве', 0, { tpah: [0, 3, 6] }],
            ['поговори', 0, { tpah: [0, 3, 8] }]
        ],
        {
            'suggestions': [
                ['погоня фильм 2011', 0, { src: 'B' }],
                ['погода на завтра', 0, { src: 'B' }],
                ['погоня за красотой фильм 2015', 0, { src: 'B' }],
                ['погода в москве на неделю', 0, { src: 'B' }],
                ['погода на неделю', 0, { src: 'B' }]
            ]
        }
    ],
    'пого': [
        'пого',
        'погода',
        [
            ['погода', 0, { tpah: [0, 4, 6] }],
            ['погоня', 0, { tpah: [0, 4, 6] }],
            ['погода в москве', 0, { tpah: [0, 4, 6] }],
            ['поговори', 0, { tpah: [0, 4, 8] }]
        ],
        {
            'suggestions': [
                ['погоня фильм 2011', 0, { src: 'B' }],
                ['погода на завтра', 0, { src: 'B' }],
                ['погоня за красотой фильм 2015', 0, { src: 'B' }],
                ['погода в москве на неделю', 0, { src: 'B' }],
                ['погода на неделю', 0, { src: 'B' }]
            ]
        }
    ],
    'погод': [
        'погод',
        'погода',
        [
            ['погода', 0, { tpah: [0, 5, 6] }],
            ['погода в москве', 0, { tpah: [0, 5, 6] }],
            ['погода на завтра', 0, { tpah: [0, 5, 6] }],
            ['погода на неделю', 0, { tpah: [0, 5, 6] }]],
        {
            'suggestions': [
                ['погода в москве на неделю', 0, { src: 'B' }],
                ['погода в москве на 14 дней', 0, { src: 'B' }],
                ['погода в москве на 3 дня', 0, { src: 'B' }],
                ['погода в москве на 14', 0, { src: 'B' }],
                ['погода москва', 0, { src: 'B' }]
            ]
        }
    ],
    'погода': [
        'погода',
        'погода',
        [
            ['погода в москве', 0, { tpah: [7, 7, 8] }],
            ['погода на завтра', 0, { tpah: [7, 7, 9] }],
            ['погода на неделю', 0, { tpah: [7, 7, 9] }],
            ['погода москва', 0, { tpah: [7, 7, 13] }]],
        {
            'suggestions': [
                ['погода', 0, { src: 'B' }],
                ['погода в москве на неделю', 0, { src: 'B' }],
                ['погода в москве на 14 дней', 0, { src: 'B' }],
                ['погода в москве на 3 дня', 0, { src: 'B' }],
                ['погода в москве на 14', 0, { src: 'B' }]
            ]
        }
    ],
    'rwusqsd': [
        'rwusqsd',
        'rwusqsd',
        [],
        {
            suggestions: []
        }
    ],
    'rwusqs': [
        'rwusqs',
        'rwusqs',
        [],
        {
            suggestions: []
        }
    ],
    'rwusq': [
        'rwusq',
        'rwusq',
        [],
        {
            suggestions: []
        }
    ],
    'погода в москве': [
        'погода в москве',
        'погода в москве на неделю',
        [
            ['погода в москве на 14', 0, { tpah: [16, 16, 18] }],
            ['погода в москве на неделю', 0, { tpah: [16, 16, 18] }],
            ['погода в москве на 3', 0, { tpah: [16, 16, 18] }],
            ['погода в москве на 10', 0, { tpah: [16, 16, 18] }]
        ],
        ['fact', 'погода в москве', '+6 °C'],
        {
            'suggestions': [
                ['погода в москве', 0, { src: 'Art_endings' }],
                ['погода в москве на 14 дней', 0, { src: 'B' }],
                ['погода в москве на месяц', 0, { src: 'B' }],
                ['погода в москве на 3 дня', 0, { src: 'B' }],
                ['погода в москве на 14 дней от гидрометцентра', 0, { src: 'B' }]
            ]
        }
    ],
    'погода в москве на 14': [
        'погода в москве на 14',
        'погода в москве на 14 дней',
        [
            ['погода в москве на 14 дней', 0, { tpah: [22, 22, 26] }],
            ['погода в москве на 14 дней от гидрометцентра', 0, { tpah: [22, 22, 26] }],
            ['погода в москве на 14 гисметео', 0, { tpah: [22, 22, 30] }],
            ['погода в москве на 14 от гидрометцентра', 0, { tpah: [22, 22, 24] }]
        ],
        {
            'suggestions': [
                ['погода в москве на 14 дней гисметео', 0, { src: 'B' }],
                ['погода в москве на 14 дней от гисметео', 0, { src: 'B' }],
                ['погода в москве на 14 дней самый точный прогноз гидрометцентра', 0, { src: 'B' }],
                ['погода в москве на 14 дней от гидрометцентра на октябрь', 0, { src: 'B' }],
                ['погода в москве на 14 дней от гидрометцентра на октябрь 2018 года', 0, { src: 'B' }]
            ]
        }
    ],
    'погода в москве на 14 дней': [
        'погода в москве на 14 дней',
        'погода в москве на 14 дней от гидрометцентра',
        [
            ['погода в москве на 14 дней от гидрометцентра', 0, { tpah: [27, 27, 29] }],
            ['погода в москве на 14 дней гисметео', 0, { tpah: [27, 27, 35] }],
            ['погода в москве на 14 дней самый точный', 0, { tpah: [27, 27, 32] }],
            ['погода в москве на 14 дней от гисметео', 0, { tpah: [27, 27, 29] }]],
        {
            'suggestions': [
                ['погода в москве на 14 дней самый точный прогноз гидрометцентра', 0, { src: 'B' }],
                ['погода в москве на 14 дней от гидрометцентра на октябрь', 0, { src: 'B' }],
                ['погода в москве на 14 дней от гидрометцентра на октябрь 2018 года', 0, { src: 'B' }],
                ['погода в москве на 14 дней от гидрометцентра на ноябрь 2018 года', 0, { src: 'B' }],
                ['погода в москве на 14 дней от гидрометцентра на сентябрь 2018', 0, { src: 'B' }]
            ]
        }
    ],
    'vkontakte': [
        'vkontakte',
        'vkontakte.ru',
        [
            [
                'vkontakte.ru', 4.46542e-05, { tpah: [0, 9, 12] }
            ],
            [
                'вконтакте', 2.88563e-05, { tpah: [0, 0, 9] }
            ],
            [
                'vkontakte вход', 9.2617e-07, { tpah: [10, 10, 14] }
            ],
            [
                'vkontakte скачать', 1.15226e-07, { tpah: [10, 10, 17] }
            ]
        ],
        [
            'nav',
            '«ВКонтакте» — социальная сеть',
            '«ВКонтакте» — социальная сеть',
            'm.vk.com',
            'http:\/\/yandex.ru\/clck\/jsredir?text=vkontakte.ru&from=yandex.ru%3Bsuggest%3Bweb' +
            '&state=dtype%3Dstred%2Fpid%3D1%2Fcid%3D71613%2Fpart%3Dvkontakte%2Fsuggestion%3Dvkontakte.ru' +
            '%2Fregion%3D1%2F%2A&data=url%3Dhttp%253A%252F%252Fm.vk.com%26ts%3D1443799317%26uid%3D949558691408610370' +
            '&sign=c7b2ea3307a73b2c8d5339fae911299a&ref=http%3A%2F%2Fxxxxxx-d-36515.bdev.serp.yandex.ru' +
            '%3A10001%2Ftouchsearch%3Ftext%3Dvkontakte%26lr%3D9999%26noredirect%3D1%26promo%3Dnomooa%26' +
            'exp_flags%3Dsuggest-touch-uri%3D%2F%2Fsuggest.yandex.ru%2Fsuggest-endings' +
            '&keyno=0&l10n=ru'
        ],
        {
            suggestions: [
                [
                    'вконтакте моя страница', 2.97185e-07
                ],
                [
                    'вконтакте моя страница войти без пароля и логина', 1.3877e-09
                ]
            ]
        }
    ],
    'вес земл': [
        'вес земл',
        'вес земли',
        [
            [
                'вес земли', 2.97185e-07, { tpah: [4, 8, 9] }
            ],
            [
                'вес землеройки', 1.3877e-09, { tpah: [4, 8, 14] }
            ]
        ],
        [
            'fact',
            'вес земли',
            '5,9736·10²⁴ кг'
        ],
        {
            suggestions: [
                [
                    'вес земли', 2.97185e-07
                ],
                [
                    'вес землеройки', 1.3877e-09
                ]
            ]
        }
    ],
    'lorem ipsum dolor sit amet consectetur adipiscing elit sed diam nonummy': [
        'lorem ipsum dolor sit amet consectetur adipiscing elit sed diam nonummy',
        'lorem ipsum dolor sit amet consectetur adipiscing elit sed diam nonummy',
        [],
        {
            suggestions: [
                ['lorem ipsum dolor sit amet consectetur adipiscing elit sed diam nonummy', 5.261111102e-09]
            ]
        }
    ],
    'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru': [
        'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru',
        'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru',
        [],
        [
            'nav',
            'перейти на сайт',
            'перейти на сайт',
            'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru',
            /* eslint max-len: 0 */
            'http:\/\/yandex.ru\/clck\/jsredir?text=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru' +
            '&from=yandex.ru%3Bsuggest%3Bweb&state=dtype%3Dstred%2Fpid%3D1%2Fcid%3D71613%2Fpart%3D' +
            'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru%2Fsuggestion%3D' +
            'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru%2Fregion%3D11119%2F%2A&' +
            'data=url%3Dhttp%253A%252F%252Faaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru' +
            '%26ts%3D1488197820%26uid%3D6678960901486125134&sign=b29131c594cb4f06337e4fe3bf4f87a1' +
            '&ref=https%3A%2F%2Flocal.yandex.ru%3A3443%2Fsearch%2Ftouch%2F&keyno=0&l10n=ru'
        ],
        {
            suggestions: [
                [
                    'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.ru', 2.038333413e-08
                ]
            ]
        }
    ]
};

module.exports = function(text) {
    return data[text] || data[''];
};
