export const testShops = {
    // Магазин с тестовым фидом акций
    DEALS: 10265670,
    PROMO: 10217829,
    // Магазин с подключенной программой субсидий
    SUBSIDY: 10229044,
    // Тестовый фейковый магазин с отзывами
    REVIEWS: 37758,
    // Тестовый магазин с рекоммендованными отзывами, но без шильдика "Заказ на Маркете"
    NON_CPA_REVIEWS: 10217829,
    // Магазин ООО
    JUR_OOO: 155,
    // Магазин ОАО
    JUR_OAO: 37758,
    // Магазин ЗАО
    JUR_ZAO: 7511,
    // Я тестовый шоп
    I_AM_A_TEST_SHOP: 774,
    BERU: 431782,
};
