INSERT INTO perfomance_history (warehouse, operationGroup, operator, company, experience, user_role,
                                qty, work_hour, supervision, ye, ye_per_shift, ye_abs, operDay, effective, result)
VALUES ('SOF', N'Другое', N'Никола Теста', N'Staff', N'Опытный сотрудник, более 3 мес', N'Администратор',
        29, N'2021-09-21 10:00', N'дневная смена', N'0.4775', N'0.6', 44, N'2021-09-21',
        N'Средняя эффективность', 50),
       ('SOF', N'Консолидация', N'Никола Теста', N'Staff', N'Опытный сотрудник, более 3 мес', N'Администратор',
        222, N'2021-09-21 11:00', N'дневная смена', N'1.3', N'1.8', 83.5, N'2021-09-21',
        N'Низкая эффективность', 500),
       ('SOF', N'Другое', N'sof-Ivanov', N'Staff', N'Опытный сотрудник, более 3 мес', N'Администратор',
        29, N'2021-09-21 10:00', N'дневная смена', N'0.4775', N'0.6', 44, N'2021-09-21',
        N'Средняя эффективность', 50),
       ('SOF', N'Консолидация', N'sof-Ivanov', N'Staff', N'Опытный сотрудник, более 3 мес', N'Администратор',
        222, N'2021-09-21 11:00', N'дневная смена', N'1.3', N'1.8', 83.5, N'2021-09-21',
        N'Низкая эффективность', 500),
       ('SOF', N'Другое', N'sof-Petrov', N'Staff', N'Опытный сотрудник, более 3 мес', N'Администратор',
        29, N'2021-09-21 10:00', N'дневная смена', N'0.4775', N'0.6', 44, N'2021-09-21',
        N'Средняя эффективность', 50),
       ('SOF', N'Консолидация', N'sof-Petrov', N'Staff', N'Опытный сотрудник, более 3 мес', N'Администратор',
        222, N'2021-09-21 11:00', N'дневная смена', N'1.3', N'1.8', 83.5, N'2021-09-21',
        N'Низкая эффективность', 500);



